pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_B3_208.0.xml
<module id="eUSCI_B3" HW_revision="208.0">
    <register id="UCB3CTLW0" width="16" offset="0x0" internal="0" description="eUSCI_Bx Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_B reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_B logic held in reset state"/>
        </bitfield>
        <bitfield id="UCTXSTT" description="Transmit START condition in master mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXSTT_0" value="0x0" description="Do not generate START condition"/>
            <bitenum id="UCTXSTT_1" value="0x1" description="Generate START condition"/>
        </bitfield>
        <bitfield id="UCTXSTP" description="Transmit STOP condition in master mode" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCTXSTP_0" value="0x0" description="No STOP generated"/>
            <bitenum id="UCTXSTP_1" value="0x1" description="Generate STOP"/>
        </bitfield>
        <bitfield id="UCTXNACK" description="Transmit a NACK" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCTXNACK_0" value="0x0" description="Acknowledge normally"/>
            <bitenum id="UCTXNACK_1" value="0x1" description="Generate NACK"/>
        </bitfield>
        <bitfield id="UCTR" description="Transmitter/receiver" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="RX" value="0x0" description="Receiver"/>
            <bitenum id="TX" value="0x1" description="Transmitter"/>
        </bitfield>
        <bitfield id="UCTXACK" description="Transmit ACK condition in slave mode" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCTXACK_0" value="0x0" description="Do not acknowledge the slave address"/>
            <bitenum id="UCTXACK_1" value="0x1" description="Acknowledge the slave address"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_B clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCLKI" value="0x0" description="UCLKI"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
            <bitenum id="UCSSEL_3" value="0x3" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI_B mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="3-pin SPI"/>
            <bitenum id="UCMODE_1" value="0x1" description="4-pin SPI (master or slave enabled if STE = 1)"/>
            <bitenum id="UCMODE_2" value="0x2" description="4-pin SPI (master or slave enabled if STE = 0)"/>
            <bitenum id="UCMODE_3" value="0x3" description="I2C mode"/>
        </bitfield>
        <bitfield id="UCMST" description="Master mode select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SLAVE" value="0x0" description="Slave mode"/>
            <bitenum id="MASTER" value="0x1" description="Master mode"/>
        </bitfield>
        <bitfield id="UCMM" description="Multi-master environment select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SINGLE" value="0x0" description="Single master environment. There is no other master in the system. The address compare unit is disabled."/>
            <bitenum id="MULTI" value="0x1" description="Multi-master environment"/>
        </bitfield>
        <bitfield id="UCSLA10" description="Slave addressing mode select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="7BIT" value="0x0" description="Address slave with 7-bit address"/>
            <bitenum id="10BIT" value="0x1" description="Address slave with 10-bit address"/>
        </bitfield>
        <bitfield id="UCA10" description="Own addressing mode select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCA10_0" value="0x0" description="Own address is a 7-bit address"/>
            <bitenum id="UCA10_1" value="0x1" description="Own address is a 10-bit address"/>
        </bitfield>
    </register>
    <register id="UCB3CTLW0_SPI" width="16" offset="0x0" internal="0" description="eUSCI_Bx Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_B reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_B logic held in reset state"/>
        </bitfield>
        <bitfield id="UCSTEM" description="STE mode select in master mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCSTEM_0" value="0x0" description="STE pin is used to prevent conflicts with other masters"/>
            <bitenum id="UCSTEM_1" value="0x1" description="STE pin is used to generate the enable signal for a 4-wire slave"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_B clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCSSEL_0" value="0x0" description="Reserved"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
            <bitenum id="UCSSEL_3" value="0x3" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="3-pin SPI"/>
            <bitenum id="UCMODE_1" value="0x1" description="4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1"/>
            <bitenum id="UCMODE_2" value="0x2" description="4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0"/>
            <bitenum id="UCMODE_3" value="0x3" description="I2C mode"/>
        </bitfield>
        <bitfield id="UCMST" description="Master mode select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SLAVE" value="0x0" description="Slave mode"/>
            <bitenum id="MASTER" value="0x1" description="Master mode"/>
        </bitfield>
        <bitfield id="UC7BIT" description="Character length" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8-bit data"/>
            <bitenum id="7BIT" value="0x1" description="7-bit data"/>
        </bitfield>
        <bitfield id="UCMSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCMSB_0" value="0x0" description="LSB first"/>
            <bitenum id="UCMSB_1" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="UCCKPL" description="Clock polarity select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="The inactive state is low"/>
            <bitenum id="HIGH" value="0x1" description="The inactive state is high"/>
        </bitfield>
        <bitfield id="UCCKPH" description="Clock phase select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCCKPH_0" value="0x0" description="Data is changed on the first UCLK edge and captured on the following edge."/>
            <bitenum id="UCCKPH_1" value="0x1" description="Data is captured on the first UCLK edge and changed on the following edge."/>
        </bitfield>
    </register>
    <register id="UCB3CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Bx Control Word Register 1">
        <bitfield id="UCGLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UCGLIT_0" value="0x0" description="50 ns"/>
            <bitenum id="UCGLIT_1" value="0x1" description="25 ns"/>
            <bitenum id="UCGLIT_2" value="0x2" description="12.5 ns"/>
            <bitenum id="UCGLIT_3" value="0x3" description="6.25 ns"/>
        </bitfield>
        <bitfield id="UCASTP" description="Automatic STOP condition generation" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="UCASTP_0" value="0x0" description="No automatic STOP generation. The STOP condition is generated after the user sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care."/>
            <bitenum id="UCASTP_1" value="0x1" description="UCBCNTIFG is set with the byte counter reaches the threshold defined in UCBxTBCNT"/>
            <bitenum id="UCASTP_2" value="0x2" description="A STOP condition is generated automatically after the byte counter value reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the threshold"/>
        </bitfield>
        <bitfield id="UCSWACK" description="SW or HW ACK control" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCSWACK_0" value="0x0" description="The address acknowledge of the slave is controlled by the eUSCI_B module"/>
            <bitenum id="UCSWACK_1" value="0x1" description="The user needs to trigger the sending of the address ACK by issuing UCTXACK"/>
        </bitfield>
        <bitfield id="UCSTPNACK" description="ACK all master bytes" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCSTPNACK_0" value="0x0" description="Send a non-acknowledge before the STOP condition as a master receiver (conform to I2C standard)"/>
            <bitenum id="UCSTPNACK_1" value="0x1" description="All bytes are acknowledged by the eUSCI_B when configured as master receiver"/>
        </bitfield>
        <bitfield id="UCCLTO" description="Clock low timeout select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCCLTO_0" value="0x0" description="Disable clock low timeout counter"/>
            <bitenum id="UCCLTO_1" value="0x1" description="135 000 SYSCLK cycles (approximately 28 ms)"/>
            <bitenum id="UCCLTO_2" value="0x2" description="150 000 SYSCLK cycles (approximately 31 ms)"/>
            <bitenum id="UCCLTO_3" value="0x3" description="165 000 SYSCLK cycles (approximately 34 ms)"/>
        </bitfield>
        <bitfield id="UCETXINT" description="Early UCTXIFG0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCETXINT_0" value="0x0" description="UCTXIFGx is set after an address match with UCxI2COAx and the direction bit indicating slave transmit"/>
            <bitenum id="UCETXINT_1" value="0x1" description="UCTXIFG0 is set for each START condition"/>
        </bitfield>
    </register>
